{
    "timestamp": "2024-07-19T18:38:03.988649",
    "query": "graduate business programs in New York",
    "response_text": "**Top Graduate Business Programs in New York City**\n\n**General MBA Programs**\n\n* **Columbia Business School (CBS):** Consistently ranked among the top programs globally, known for its rigorous curriculum and focus on finance and strategy.\n* **New York University's Stern School of Business:** Renowned for its strong finance, marketing, and entrepreneurship programs.\n* **Cornell University's Samuel Curtis Johnson Graduate School of Management:** Located in Ithaca, NY, but with a significant presence in NYC, offering a top-notch MBA program with a focus on leadership and innovation.\n* **University of Rochester's Simon Business School:** Offers an MBA program with a focus on data analytics, technology, and operations management.\n\n**Specialized MBA Programs**\n\n* **Baruch College, City University of New York (CUNY):** Known for its affordable MBA programs in real estate, financial management, and international business.\n* **Fordham University's Gabelli School of Business:** Offers specialized MBA programs in finance, marketing, and operations management.\n* **Hofstra University's Frank G. Zarb School of Business:** Provides MBA programs with a focus on hospitality, sports management, and healthcare.\n* **St. John's University's The Peter J. Tobin College of Business:** Offers MBA programs in finance, marketing, and management information systems.\n\n**Executive MBA Programs**\n\n* **Columbia Business School's Executive MBA:** Designed for experienced professionals, offering a rigorous part-time program with a focus on leadership and strategy.\n* **New York University's Stern School of Business's Executive MBA:** Focuses on globalization, technology, and innovation, catering to senior-level executives.\n* **Cornell University's Johnson Cornell Tech MBA:** A joint program between Cornell and the Technion-Israel Institute of Technology, focusing on technology, innovation, and entrepreneurship.\n* **Wharton School of the University of Pennsylvania's Advanced Management Program (AMP):** A non-degree executive program designed for senior leaders, offering a comprehensive overview of business management.\n\n**Part-Time MBA Programs**\n\n* **Brooklyn College, CUNY's Part-Time MBA:** Offers a flexible program for working professionals, with a focus on finance and marketing.\n* **City University of New York's Baruch College's Zicklin School of Business's Part-Time MBA:** Known for its affordable program and focus on international business and real estate.\n* **New York University's Stern School of Business's Part-Time MBA:** Designed for experienced professionals, offering a rigorous curriculum with a focus on leadership and strategy.\n* **Pace University's Lubin School of Business's Part-Time MBA:** Offers a program with a focus on technology, finance, and healthcare.",
    "form_data": {
        "first_name": "J",
        "last_name": "V",
        "email": "j@test.net",
        "dob": "2024-07-19",
        "graduation_year": 1900,
        "zip_code": "55588",
        "interested_schools": []
    }
}