{
    "timestamp": "2024-07-19T23:17:02.109901",
    "query": "graduate business programs in New York",
    "response_text": "**Top Graduate Business Programs in New York**\n\n**Tier 1**\n\n* Columbia Business School (Columbia University)\n* New York University Stern School of Business (NYU Stern)\n* Harvard Business School (HBS) - New York City Campus\n* Cornell University Samuel Curtis Johnson Graduate School of Management\n* University of Pennsylvania Wharton School (Penn Wharton) - New York City Campus\n\n**Tier 2**\n\n* Fordham University Gabelli School of Business\n* Baruch College Zicklin School of Business (CUNY)\n* City University of New York Baruch College - Marxe School of Public and International Affairs\n* Long Island University - Brooklyn Campus (LIU)\n* Pace University Lubin School of Business\n\n**Tier 3**\n\n* St. John's University - The Peter J. Tobin College of Business\n* Manhattan College Dorothy and Peter Lynch School of Business\n* Hofstra University Frank G. Zarb School of Business\n* Iona College Hynes Institute for Entrepreneurship & Innovation\n* New York Institute of Technology (NYIT)\n\n**Other Notable Programs**\n\n* New School for Social Research - Milano School of International Affairs, Management & Urban Policy\n* The College of New Rochelle School of Business & Technology\n* Stony Brook University - College of Business\n* Syracuse University - Martin J. Whitman School of Management\n* Rochester Institute of Technology - Saunders College of Business\n\n**Factors to Consider**\n\n* **Reputation:** The reputation of the program within the business world and academia.\n* **Curriculum:** The quality and relevance of the coursework, as well as the availability of specializations.\n* **Faculty:** The experience and expertise of the faculty, and their willingness to engage with students.\n* **Career Services:** The support provided to students in finding internships and full-time employment.\n* **Alumni Network:** The strength and accessibility of the alumni network.\n* **Location:** The proximity to industry centers and potential career opportunities.",
    "form_data": {
        "first_name": "J",
        "last_name": "V",
        "email": "t@est.com",
        "dob": "2024-07-19",
        "graduation_year": 1900,
        "zip_code": "52403",
        "interested_schools": []
    }
}